{"class_name": "Model", "config": {"name": "model_83", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_43"}, "name": "input_43", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_168", "trainable": false, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_168", "inbound_nodes": [[["input_43", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_105", "trainable": false, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_105", "inbound_nodes": [[["dense_168", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_21", "trainable": false, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_21", "inbound_nodes": [[["leaky_re_lu_105", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_169", "trainable": false, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_169", "inbound_nodes": [[["dropout_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_84", "trainable": false, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_84", "inbound_nodes": [[["dense_169", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_106", "trainable": false, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_106", "inbound_nodes": [[["batch_normalization_84", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_170", "trainable": false, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_170", "inbound_nodes": [[["leaky_re_lu_106", 0, 0, {}]]]}], "input_layers": [["input_43", 0, 0]], "output_layers": [["dense_170", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}